BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/AT90PWM216.PIC
        <edc:AdjustPoint edc:_addr="0xD1" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR0RB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0"/>
        <edc:SFRDef edc:_addr="0xDA" edc:access="nnnnnnn-" edc:cname="PCNF0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL0" edc:desc="PSC 0 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP0" edc:desc="PSC 0 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE0" edc:desc="PSC 0 Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PLOCK0" edc:desc="PSC 0 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK0" edc:desc="PSC 0 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY0" edc:desc="PSC 0 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDB" edc:access="nnnnnnnn" edc:cname="PCTL0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN0" edc:desc="PSC 0 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC0" edc:desc="PSC0 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARUN0" edc:desc="PSC0 Auto Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC0A" edc:desc="PSC 0 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC0B" edc:desc="PSC 0 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM0" edc:desc="PSC 0 Balance Flank Width Modulation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE0" edc:desc="PSC 0 Prescaler Selects" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDC" edc:access="nnnnnnnn" edc:cname="PFRC0A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0A" edc:desc="PSC 0 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0A" edc:desc="PSC 0 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0A" edc:desc="PSC 0 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0A" edc:desc="PSC 0 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0A" edc:desc="PSC 0 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDD" edc:access="nnnnnnnn" edc:cname="PFRC0B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0B" edc:desc="PSC 0 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE0B" edc:desc="PSC 0 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0B" edc:desc="PSC 0 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0B" edc:desc="PSC 0 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE0B" edc:desc="PSC 0 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDE" edc:access="n---nnnnnnnnnnnn" edc:cname="PICR0" edc:nzwidth="0x10" ltx:memberofperipheral="PSC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PICR0" edc:desc="PSC 0 Input Capture Bytes" edc:nzwidth="0xC"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCST0" edc:desc="PSC 0 Input Capture Software Trig" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xE0" edc:offset="0x10"/>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="PSOC2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN2A" edc:desc="PSCOUT20 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2C" edc:desc="PSCOUT22 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2B" edc:desc="PSCOUT21 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2D" edc:desc="PSCOUT23 Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC2" edc:desc="Synchronization Out for ADC Selection" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="POS2" edc:desc="PSC 2 Output 23 Select" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="POM2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POMV2A" edc:desc="Output Matrix Output A Ramps" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="POMV2B" edc:desc="Output Matrix Output B Ramps" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xF8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR2RB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC2"/>
        <edc:SFRDef edc:_addr="0xFA" edc:access="nnnnnnnn" edc:cname="PCNF2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POME2" edc:desc="PSC 2 Output Matrix Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL2" edc:desc="PSC 2 Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POP2" edc:desc="PSC 2 Output Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE2" edc:desc="PSC 2 Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PLOCK2" edc:desc="PSC 2 Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALOCK2" edc:desc="PSC 2 Autolock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFIFTY2" edc:desc="PSC 2 Fifty" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFB" edc:access="nnnnnnnn" edc:cname="PCTL2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN2" edc:desc="PSC 2 Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC2" edc:desc="PSC2 Complete Cycle" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARUN2" edc:desc="PSC2 Auto Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC2A" edc:desc="PSC 2 Asynchronous Output Control A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PAOC2B" edc:desc="PSC 2 Asynchronous Output Control B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PBFM2" edc:desc="Balance Flank Width Modulation" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE2" edc:desc="PSC 2 Prescaler Selects" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFC" edc:access="nnnnnnnn" edc:cname="PFRC2A" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2A" edc:desc="PSC 2 Retrigger and Fault Mode for Part A" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2A" edc:desc="PSC 2 Filter Enable on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2A" edc:desc="PSC 2 Edge Level Selector on Input Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2A" edc:desc="PSC 2 Input Select for Part A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2A" edc:desc="PSC 2 Capture Enable Input Part A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xFD" edc:access="nnnnnnnn" edc:cname="PFRC2B" edc:nzwidth="0x8" ltx:memberofperipheral="PSC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2B" edc:desc="PSC 2 Retrigger and Fault Mode for Part B" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PFLTE2B" edc:desc="PSC 2 Filter Enable on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2B" edc:desc="PSC 2 Edge Level Selector on Input Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2B" edc:desc="PSC 2 Input Select for Part B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCAE2B" edc:desc="PSC 2 Capture Enable Input Part B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
